---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRoundHSS
source: html/4ebde832-2924-d6e2-2470-e025d71cf551.htm
---
# StructuralSectionRoundHSS Members

Creates a new instance of Structural Section Round HSS shape with the associated set of parameters,
 used to attach to structural element.